"use strict"
let arr = ["Аліна", "Рома", "Вадім"];
arr.splice(-1, 1, "Міша");
console.log(arr);

//arr.splice(старт, кількість елементів для видалення або  для заміни?? 0 для додавання бе видалення, на який елемент замінити  )

// arr.splice(0, 0, "Міша"); = arr.unshift('Міша')
// arr.splice(-1, 1,); = arr.pop();


// задача № 2 
/* 
1) Створити масив з елементами "Ваня" "Іштван"
2) Додати "Оля" в кінець списку 
3) Замінити значення "Іштван" на "Петя"
4) код пошуку повинен працювати для будьякої довжини масиву
5) видаліть перший елемент масиву та виведіть в консоль
6) вставте "Маша" і "Паша" в початок списку
*/
let users = ["Ваня", "Іштван"]; //1)
users.push("Оля"); //2)
let replacedUserIndex = users.indexOf("Іштван"); // пошук індексу елементу для видалення (так працює лише до першого співпадіння)
users.splice(replacedUserIndex, 1, "Петя"); //3)
let removedUser = users.splice(0, 1); //5)
console.log(removedUser);//5)
users.splice(0, 0, "Маша", "Паша"); //5)
console.log(users);


// завдання 4 

// зробити з рядка Ваня Іштван Оля масмв 
let srting = 'Ваня,Іштван,Оля';
let newArr = string.split(',');
console.log(newArr);