"use strict";
console.log('==== Розміри , прокрутка , координати ====');
//========================================================================================================================================================

//? Задача 1
//todo Дізнатися шиирину полоси прокрутки скролбара
let sizeScrollbar;
const pageElement = document.documentElement; // Звертаюся до html
const pageWidth = pageElement.clientWidth; // Дізнаюся доступну ширину робочої області
const windowWidht = window.innerWidth; // Дізнаюся ширину в'юпорта
sizeScrollbar = windowWidht - pageWidth;// Дізнаюся ширину скролбара= ширину в'юпорта - ширину робочої області
console.log(sizeScrollbar);
//========================================================================================================================================================

//? Задача 2
//todo Змусити браузар прокрутитися на 100px зверху через секунду після відкриття сторінки
let startScrollValue = "100px"; // задане значення
let windowScrollTop;
function setScrollBy(startScrollValue) {
    window.scrollBy(0, startScrollValue);// Прокручую вікно браузера на задане значення
    windowScrollTop = window.scrollY;
}
setTimeout(setScrollBy(startScrollValue), 1);// встановлюю затримку виклику функції 1с, але це не достовірна 1 с.
//========================================================================================================================================================

//? Задача 3
//todo Отримайте координати різних трьох об'єктів
